[
  {
    "path": "posts/2021-05-24-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "The purpose of the DataViz makeover is to improve on the original visualization. The limitations of the original graph will be pointed out. An alternative data to solve the original issues. The data used in this DataViz Makeover is provided by the [**Department of Statistics, Singapore (DOS)**](https://www.singstat.gov.sg/find-data/search-by-theme/trade-and-investment/merchandise-trade/latest-data).",
    "author": [
      {
        "name": "Liu Manye",
        "url": {}
      }
    ],
    "date": "2021-05-24",
    "categories": [],
    "contents": "\r\nOriginal Data Visualization\r\nThe original data visualization looks like the graph presented below:  The graph presented the merchandise imports and exports of 6 different countries between 2019 to 2020. Six countries included should be the top six trading countries that have the greatest trading values.\r\nPart A: Critique of Visualisation\r\nClarity\r\nUninformed Title: The title of the original graph “Merchandise Trade of Top Six Trading Countries, 2019-2020” does not indicate what the visualization is intended to do. It is quite vague to say what message this graph trying to emphasize. Does it highlight the differences between imports and exports value within 6 countries or does it compare merchandise trading trends of these countries? An unclear title makes it difficult for the audience to catch the key message quickly.\r\nInconsistency of period presented: The x-axis label for Japan is different from the others (2020 only). The graph of Japan contains less information than the others. The difference between the trading history of Japan and that of other countries is unclear because of this limitation.\r\nInconsistency of y-axes units: y axes of the graphs of 6 countries have inconsistent labels. For instance, each unit of the Export axis of Hong Kong represents 2M, but each unit of the same axis on the graph of Japan and Taiwan represents 1M only. The same issue can also be found for the Import axes of these graphs. The inconsistency of y-axes would make it difficult to compare the trading history of different countries.\r\nDual axis is out of sync: y axes of export and import share different units for the same country. This makes it hard for the audience to compare the imports and exports value of a specific country.\r\nUnnecessary use of Area Chart: Area chart should be considered only if the total of the value presented is as important as its shares or if there is a large difference between the value presented. However, the original graph does not have any of these purposes. On the other hand, a line graph can display the trading patterns of each country better and a bar chart would be a better choice to be used to emphasize the difference between each country’s imports and exports value.\r\nNo Annotation: Annotation that helps to tell the data story is not used in the original graph.\r\nAesthetic\r\nInvisible Tick Mark: Tick marks are necessary on a continuous scale. They help to mark the major divisions and show the exact point on the axis. The colour of tick marks on the original is too light and makes them invisible and unhelpful.\r\nPoor color choice: Imports and Exports are displayed using two different colours in the original graph. However, both colours are too light hence they do not contrast sufficiently with each other. Using brighter colors will improve the aesthetics of the visualization.\r\nSeparated graphs: Merchandise trades of these countries are presented in 6 separate graphs. 6 graphs are too much to be showed on one dashboard; this makes the whole visualization ununited and scattered. To improve the aesthetics, data should be presented with a smaller number of separated graphs.\r\nLegend: A legend is used to indicate different trading types. It could be quite troublesome for audiences to check the legend when they read the graph. A legend should be replaced by a direct label if possible.\r\nPart B: Alternative Design\r\nThe proposed alternative visualization design is displayed below:\r\n\r\nAdvantages of the new design:\r\nClarity\r\nClear titles are provided to indicate the purpose of the graphs and help audiences to catch the key information quickly.\r\nConsistency of the units and labels for the x-axis and y-axis. This would make avoid the misleading display of the data provided.\r\nDisplay trading data in a quarter unit would display smaller changes that cannot be found in the original graph.\r\nBetter graph formats are adopted to deliver the data in a better and clearer way.\r\nAnnotation will be added to help to tell the data story.\r\nAesthetic\r\nTick marks can be seen by the audiences and help them to identify the divisions on the axis.\r\nLegends can be replaced by direct labels. This makes it easier for the audience to read and also enhance the tidiness of the visualization\r\nFewer graphs are presented on one dashboard. Information is united and the display of the dashboard would be more organized.\r\nContrasting colors are used to help to deliver the information and improve the aesthetic design of the visualization.\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\n\r\nFigure below shows the quadrat plot of Tableau. image 2 below \r\nNext, you will use the code chunk below to install and launch ggpubr and tidyverse in RStudio.\r\nR code\r\npackages = c(‘ggpubr’, ‘tidyverse’)\r\nfor(p in packages){library if(!require(p, character.only = T)){ install.packages(p) } library(p, character.only = T) }\r\n3.0 Importing and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Importing Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\nR code\r\nwine <- read_csv(“data/wine_quality.csv”)\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted by using ggplot() and geom_histogram() of ggplot2 package. Then, ggarrange() of ggpubr package is used to patch these histogram into a single figure to reveal the distribution of the selected variables in the wine quality data sets.\r\nRcode\r\nfa <- ggplot(data=wine, aes(x= fixed acidity)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) va <- ggplot(data=wine, aes(x= volatile acidity)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) ca <- ggplot(data=wine, aes(x= citric acid)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) rs <- ggplot(data=wine, aes(x= residual sugar)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) ch <- ggplot(data=wine, aes(x= chlorides)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) fSO2 <- ggplot(data=wine, aes(x= free sulfur dioxide)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) tSO2 <- ggplot(data=wine, aes(x= total sulfur dioxide)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) density <- ggplot(data=wine, aes(x= density)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) pH <- ggplot(data=wine, aes(x= pH)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) sulphates <- ggplot(data=wine, aes(x= sulphates)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) alcohol <- ggplot(data=wine, aes(x= alcohol)) + geom_histogram(bins=20, color=“black”, fill=“light blue”)\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, ncol = 4, nrow = 3)\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T01:03:07+08:00",
    "input_file": "dataviz-makeover-1.knit.md"
  }
]
