[
  {
    "path": "posts/2021-06-09-dataviz-makeover-2/",
    "title": "DataViz-Makeover-2",
    "description": "The purpose of the DataViz makeover is to improve on the original visualization.",
    "author": [
      {
        "name": "Liu Manye",
        "url": {}
      }
    ],
    "date": "2021-06-09",
    "categories": [],
    "contents": "\r\nOriginal Data Visualization\r\nThe original data visualization looks like the graph presented below:  The graph presented Singapore’s merchandise trade performance with 10 major trading partners in 2020. It is created by using data provided by the Department of Statistics, Singapore (DOS). The data can be download under the sub-section of Merchandise Trade by Region/Market.\r\nPart A: Critique of Visualisation\r\nClarity\r\nMissing Title: The title cannot be found in the image provided. This means no insights were highlighted and audiences cannot catch the key information this visualization tries to deliver immediately.\r\nAxis title: Titles and labels for both axes fail to indicate the unit of measure for the exports and imports value presented. Since the unit of measure for both axes is unclear, we also have a problem finding out if these axes are synchronized or not.\r\nUnclear message delivery: The original visualization tries to indicate whether a particular trading partner is a net exporter or a net importer by showing which color region (green or blue) its center point falls. For some trading partners, it is hard to tell which region do they fall in because of the crowdedness and unreasonable graph design. Some circles are too big, and this makes it hard for the audience to see the position of the center points. Circles cover up each other when these trading partners share similar merchandise trading values, and some center points cannot be seen at all. This makes the graph unclear and very difficult to read.\r\nToo much information:  The original visualization contains too much information at the same time, and this makes it hard to read:\r\nThe size of the circle and information in the tooltips reflect the size of total merchandise trading value instead of the imports and exports value presented on axes. This could be confusing to the audience.\r\nThe background of the original graph separates trading partners into two groups: those that have positive merchandise trading balance with Singapore and those that have negative ones.\r\nThe annotations of star signs with different color backgrounds indicate trading partners that have the greatest net import/export value. These annotations are placed above tooltips that contain total merchandise trading value, which could be misleading.\r\nNo labels or legends are shown in the graph to indicate the information indicated by the color and size of the circles and the background color. Legends of the star signs are placed under the long notes of the graph, and this makes the graph hard to read. Audiences need to read the long notes to understand the complicated design of the original visualization.\r\nOne-year trading details only Only the trading details of 2020 are visualized in the original graph. The variations and changes in the trade performance of these top trading partners cannot be seen.\r\nAesthetic\r\nMissing Tick Mark: Tick marks are necessary on a continuous scale. They help to mark the major divisions and show the exact point on the axis. Tick marks are missing for both axes in the original visualization.\r\nPoor color choice:\r\nFor the bubbles: The colors of different circles represent different trading partners. However, some colors in the original graph are do not sufficiently contrast with each other. For instance, the colors of Thailand and the EU are almost the same. Red and Green are used at the same time, which is not friendly to color blinder readers.\r\nFor the background: The light green and blue combination for the background is not a wise choice as light colors with similar tones could be easily ignored by the readers.\r\nTransparency: Transparency of the circle should be used to avoid occlusion issue.\r\nMessy Tooltip: Tooltip for all the circles are always showed in the original visualization. In this way, key information and significant findings cannot be highlighted.\r\nPart B: Alternative Design\r\nThe proposed alternative visualization design is displayed below:\r\n\r\nAdvantages of the new design\r\nClarity\r\nClear titles are provided to indicate the purpose of the graphs and help audiences to catch the key information quickly.\r\nClear axes title and labels are displayed.\r\nUse different colors and sizes to assist readers to compare the differences between different years or different trading partners\r\nA reference line is provided to assist the audience to read the visualizations.\r\nThere is a Clear theme for each chart, not too much information at once.\r\nEdited Tooltips that help to highlight the key message\r\nInteractive filters and motion play allow the audience to access more trading information\r\nAesthetic\r\nTick marks can be seen by the audiences and help them to identify the divisions on the axis.\r\nLegends are hidden or replace by direct labels to improve the tidiness of the visualization.\r\nTransparency is used to avoid occlusion issues.\r\nContrasting colors are used to help to deliver the information and improve the aesthetic design of the visualization.\r\nOnly important information will be labeled. This also improves the tidiness of the graphs.\r\nPart C: Proposed Visualisation\r\nPlease view the interactive visualization on Tableau Public here\r\nPart D: Step-by-step Guide\r\nAfter downloading data from the Department of Statistics, Singapore (DOS), the instruction below will illustrate how can we prepare the proposed alternative data visualization step-by-step.\r\nData Preparation\r\nUnzip the output folder downloaded from the website. Reorganizing the data by using Excel and Tableau for further use. All the steps below should be operated for both T1 and T2 sheets that contain Imports and Exports trading data separately.\r\nStep 1: Delete unnecessary rows and content sheets in the original file for the convenience of future operations. Since this DataViz Makeover will only focus on top trading partners that are included in the original visualization (Mainland China, Malaysia, Indonesia, United States. Taiwan, Japan, Hong Kong, EU, Republic of Korea, and Thailand). The study period is set to be between January 2011 to December 2020. We can high-lighted the data of the desired partners and remove the undesired data. The cleaned data looks like the image below:\r\n\r\nStep 2: Select all the remaining data in T1 and T2 and paste them in newly created datasheets named ‘Imports’ and ‘Exports’. Select the Transpose option while pasting. In this way, we can have the exports and imports value of each trading partner presented separately.\r\n\r\nStep 3: In the original dataset, European Union has different units (Million Dollars) from the other trading partners (Thousand Dollars). To make it easier for audiences to read the data visualization that will be created, I decided to unify the measuring unit for all trading partners to Million Dollars. To do this, I recalculate the value for every trading partner except the EU by dividing the original value over 1000 and then replace the old imports/exports value with the new ones.\r\n\r\nStep 4: Save the cleaned excel file and open it in Tableau. Drag ‘Imports’ in the main pane. Select every variable except ‘Variables’, right-click and select Pivot. Two Pivot Field variables that contain trading partners and Import value will be generated.\r\n\r\nStep 5: Right-click the newly created pivot variable that contains trading partner data and select ‘split’. A new variable will be generated which contains the trading partner’s information only. “(Million Dollars)” that shows repeatedly in every cell will be removed.\r\n\r\nStep 6: Hide the variable that contains both trading partner information and measure unit. Set the three remaining variables into the correct data format. The original “Variables” is renamed as “Time” and set in Date format. The newly split variable is renamed as “Trading Partners” and plays as Country/Region. The last pivot variable is renamed as “Imports” and set into a Number (decimal) data format. Maximize the number of rows presented to ensure all instances in the dataset can be seen in Tableau.\r\n\r\nStep 7: Repeat steps 4 to 6 for the Exports dataset. Copy the values for 4 variables “Time”, “Trading Partners”, “Imports”, and “Exports”. Paste these four variables in a newly created excel sheet called Final Data.\r\n\r\nCreating Worksheets\r\nThere are four charts will be created in this DataViz Makeover. Each chart will help the audience to analyze the providing data differently.\r\nFirst Chart:\r\nStep 1 Open the Excel file that we previously prepared in Tableau. Drag Final Data into the main pane and make sure every variable is in the right data format. The dataset should look like the image displayed below:\r\n\r\nStep 2: Add two new calculated variables in Tableau that represents Singapore’s Balance of Trade and total merchandise trading value with each trading partner. Get into the worksheet window, select Analysis > Create Calculated Field. Creating the formula of Total Trade Value (Million Dollars) by dragging the existed variables into the newly opened window to form the equation below:\r\n\r\nGet into the worksheet window, select Analysis > Create Calculated Field. Creating the formula of Balance of Trade (Million Dollars) by dragging the existed variables into the newly opened window to form the equation below:\r\n\r\nThen we can find a new variable on the left side panel.\r\nStep 3: Create a new worksheet and name it ‘Interactive Bubble Plot’. Drag ‘Total Trade Value’ to Columns and ‘Balance of Trade’ to Rows.\r\n\r\nStep 4: Under ‘Marks’ Pane, select ‘Circle’ from the dropdown list. Drag ‘Trading Partners’ to Detail so that we can have one circle represent each trading partner on the chart. Drag ‘Total Trade Value’ to Size and drag ‘Balance of Trade’ to Color. In this way, we can have the size of each circle representing the total merchandise trading volume of each trading partner and the color of each circle representing its balance of trade with Singapore.\r\n\r\nStep 5: Double-click on the color legends on the right side of the worksheet to edit the color setting. Select Red-Blue-White Diverging from the dropdown list. In this way, circles will be displayed in red if the value of import for a particular trading partner exceeds its exports, and blue otherwise. Tick the box of ‘Use Full-Color Range’ to ensure the color presentation of the chart is rich enough and is significantly in contrast with each other and the background. Click <<Advanced bottom to lock the Center to 0. Click on Color under the Marks pane to set the Opacity to 70% to avoid occlusion issues. Set the Border to white color so that the border of each circle is clearer.\r\n\r\nStep 6: Click on Size under Marks pane and adjust the size of circles.\r\n\r\nStep 7: Drag ‘Trading Partners’ and ‘Balance of Trade’ into Label under Marks pane. Click on Label to edit the label set. Change the Alignment to ‘Middle Center’. Change the marks to label from ‘All’ to ‘Min/Max’. Set the Field to ‘Sum(Balance of Trade)’ and tick both boxes before label maximum value and label minimum value.\r\n\r\nStep 8: Right-click on the y-axis to add Reference Line. Set the line at a constant value of 0. Change the format of the reference line into a dotted line and set the color to light red.\r\n\r\nStep 9: Drag ‘Time’ into Filters pane. Select ‘Show Filter’ from the dropdown list so that the filter can be seen on the right side of the worksheet. Change the filter list to a form of ‘Single Value (list)’, click on ‘Edit Title’ and rename the filter to ‘Select Year’. Click on customize and untick the box before ‘Show “All” Value’.\r\n\r\nStep 10: Select Analysis > Create Calculated Field. Creating the formulas of Net Exports (Million Dollars) and Net Imports as the image displayed below:\r\n\r\nStep 11: Drag ‘Net Exports’ and ‘Net Imports’ to Tooltip under Marks pane. Double-click on Tooltip to edit the text of the tooltip as the image displayed below.\r\n\r\nStep 12: Edit Title of this chart by typing “Merchandise Total Trade Value and Trade Balance of Top Trading Partners”. Click ‘Insert’ and choose ‘YEAR(Time)’ from the dropdown list. The font size is set to be 15 and bold.\r\n\r\nStep 13: Formatting the tick marks on the axes into a darker black. Thick mark help to show the exact point on the axis.\r\n\r\nStep 14: Hide the Color and Size legends in the worksheet since they are not very informative for the readers.\r\nSecond Chart:\r\nStep 1: Duplicate the first worksheet that we have created and name it ‘Motion Graph’.\r\n\r\nStep 2: Remove ‘Time’ from the Filters pane and drag ‘Trading Partners’ into it. Select ‘Show Filter’ from the dropdown list so that the filter can be seen on the right side of the worksheet. Keep the setting of ‘Multiple Values (list)’, click on ‘Edit Title’ and rename the filter to ‘Select Trading Partners’.\r\n\r\nStep 3: Drag ‘Time’ into the Pages pane and we can see the motion play card on the right side of the worksheet. Select Format > Animation, turn on the animation setting, and change the duration of play to 1.00 seconds (Slow).\r\n\r\nStep 4: Edit Title as the image shown below. Click ‘Insert’ and choose ‘Trading Partners’ from the dropdown list. The font size is set to be 15 and bold.\r\n\r\nThird Chart:\r\nStep 1: Create a new worksheet and name it ‘interactive bar-line graph’. Drag ‘Year(Time)’ to Columns and ‘Total Trade Value’ and ‘Balance of Trade’ to Rows.\r\n\r\nStep 2: Under Marks pane, select ‘Bar’ from the dropdown list for ‘Total Trade Value’ and select ‘Line’ for ‘Balance of Trade’.\r\n\r\nStep 3: Drag ‘Balance of Trade’ into Color under the Balance of Trade section in the Marks pane. Double-click on the color legends on the right side of the worksheet to edit the color setting. Select Red-Blue-White Diverging from the dropdown list. In this way, circles will be displayed in red if the value of import for a particular trading partner exceeds its exports, and blue otherwise. Tick the box of ‘Use Full Color Range’ to ensure the color presentation of the chart is rich enough to sufficiently contrast with the bar chart of ‘Total Trade Value’. Click <<Advanced bottom to lock the Center to 0. Click ‘Color’ under the Total Trade Value section and set the color of bars to light yellow.\r\n\r\nStep 4: Drag ‘Trading Partners’ into Filters pane. Select ‘Show Filter’ from the dropdown list so that the filter can be seen on the right side of the worksheet. Change the filter list to a form of ‘Single Value (list)’, click on ‘Edit Title’ and rename the filter to ‘Select Trading Partners’.\r\n\r\nStep 5: Right-click on one of the y-axes and select ‘Synchronize Axis’. Choose ‘Format’ to set the color of the dual-axis title into a matching color and set the color of the Tick Marks into a darker one.\r\n\r\nStep 6: Hide legends from Readers since they are not very informative.\r\nStep 7: Edit Title of this chart ‘Merchandise Trading Patterns of Top 6 Countries (2019-2020)’. The font size is set to be 15 and bold.\r\n\r\nFourth Chart:\r\nStep 1: Create a new worksheet and name it ‘Interactive Balance trade graph’. Drag ‘Trading Partners’ to Columns and ‘Imports’ and ‘Measure Values’ as a dual to Rows. ‘Measure Values’ should include ‘Imports’ and ‘Exports’ only.\r\n\r\nStep 2: Under Marks pane, select ‘Gantt Bar’ from the dropdown list for ‘Imports’ and select ‘Circle’ for ‘Measure Values’.\r\n\r\nStep 3: Drag ‘Balance of Trade’ into Color and Size under the Imports section under Marks pane. Double-click on the color legends on the right side of the worksheet to edit the color setting. Select Red-Blue-White Diverging from the dropdown list. In this way, Gantt bars will be displayed in red if the value of import for a particular trading partner exceeds its exports, and blue otherwise. Tick the box of ‘Use Full Color Range’ to ensure the color presentation of the chart is rich enough. Set Opacity of the color to 40%.\r\n\r\nStep 4: To match the overall color theme of Balance of Trade, I change the color of ‘Exports’ to Blue and the color of ‘Imports’ to Red.\r\n\r\nStep 5: Drag ‘Time’ into Filters pane. Select ‘Show Filter’ from the dropdown list so that the filter can be seen on the right side of the worksheet. Change the filter list to a form of ‘Single Value (list)’, click on ‘Edit Title’ and rename the filter to ‘Select Year’. Click on customize and untick the box before ‘Show “All” Value’.\r\n\r\nStep 6: Right-click on one of the y-axes and select ‘Synchronize Axis’. Choose ‘Format’ to set the color of the Tick Marks into a darker one. Hide the header of the y-axis on the right side and change the title of the other axis into ‘Imports and Exports’.\r\n\r\nStep 7: Hide legends from Readers since they are not very informative.\r\nStep 8: Edit Title of this chart as the image displayed below. The font size is set to be 15 and bold.\r\n\r\nCombining worksheets into a Dashboard\r\nCreate a new dashboard and drag ‘Interactive Bubble Plot’ and ‘Interactive Balance trade graph’ in. Select one of the Time filters and set these two worksheets using this data source by following the instruction shown below: \r\nAdd ‘Motion Graph’ and ‘interactive bar-line graph’ in the same dashboard but different filters are used for these two worksheets.\r\nFinal look of the dashboard: \r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-20T20:34:17+08:00",
    "input_file": "dataviz-makeover-2.knit.md"
  },
  {
    "path": "posts/2021-05-24-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "The purpose of the DataViz makeover is to improve on the original visualization. The limitations of the original graph will be pointed out. An alternative data to solve the original issues.",
    "author": [
      {
        "name": "Liu Manye",
        "url": {}
      }
    ],
    "date": "2021-05-24",
    "categories": [],
    "contents": "\r\nOriginal Data Visualization\r\nThe original data visualization looks like the graph presented below:  The graph presented the merchandise imports and exports of 6 different countries between 2019 to 2020. Six countries included should be the top six trading countries that have the greatest trading values.\r\nPart A: Critique of Visualisation\r\nClarity\r\nUninformed Title: The title of the original graph “Merchandise Trade of Top Six Trading Countries, 2019-2020” does not indicate what the visualization is intended to do. It is quite vague to say what message this graph trying to emphasize. Does it highlight the differences between imports and exports value within 6 countries or does it compare merchandise trading trends of these countries? An unclear title makes it difficult for the audience to catch the key message quickly.\r\nInconsistency of period presented: The x-axis label for Japan is different from the others (2020 only). The graph of Japan contains less information than the others. The difference between the trading history of Japan and that of other countries is unclear because of this limitation.\r\nInconsistency of y-axes units: y axes of the graphs of 6 countries have inconsistent labels. For instance, each unit of the Export axis of Hong Kong represents 2M, but each unit of the same axis on the graph of Japan and Taiwan represents 1M only. The same issue can also be found for the Import axes of these graphs. The inconsistency of y-axes would make it difficult to compare the trading history of different countries.\r\nDual axis is out of sync: y axes of export and import share different units for the same country. This makes it hard for the audience to compare the imports and exports value of a specific country.\r\nUnnecessary use of Area Chart: Area chart should be considered only if the total of the value presented is as important as its shares or if there is a large difference between the value presented. However, the original graph does not have any of these purposes. On the other hand, a line graph can display the trading patterns of each country better and a bar chart would be a better choice to be used to emphasize the difference between each country’s imports and exports value.\r\nNo Annotation: Annotation that helps to tell the data story is not used in the original graph.\r\nAesthetic\r\nInvisible Tick Mark: Tick marks are necessary on a continuous scale. They help to mark the major divisions and show the exact point on the axis. The colour of tick marks on the original is too light and makes them invisible and unhelpful.\r\nPoor color choice: Imports and Exports are displayed using two different colours in the original graph. However, both colours are too light hence they do not contrast sufficiently with each other. Using brighter colors will improve the aesthetics of the visualization.\r\nSeparated graphs: Merchandise trades of these countries are presented in 6 separate graphs. 6 graphs are too much to be showed on one dashboard; this makes the whole visualization ununited and scattered. To improve the aesthetics, data should be presented with a smaller number of separated graphs.\r\nLegend: A legend is used to indicate different trading types. It could be quite troublesome for audiences to check the legend when they read the graph. A legend should be replaced by a direct label if possible.\r\nPart B: Alternative Design\r\nThe proposed alternative visualization design is displayed below:\r\n ### Advantages of the new design:\r\nClarity\r\nClear titles are provided to indicate the purpose of the graphs and help audiences to catch the key information quickly.\r\nConsistency of the units and labels for the x-axis and y-axis. This would make avoid the misleading display of the data provided.\r\nDisplay trading data in a quarter unit would display smaller changes that cannot be found in the original graph.\r\nBetter graph formats are adopted to deliver the data in a better and clearer way.\r\nAnnotation will be added to help to tell the data story.\r\nAesthetic\r\nTick marks can be seen by the audiences and help them to identify the divisions on the axis.\r\nLegends can be replaced by direct labels. This makes it easier for the audience to read and also enhance the tidiness of the visualization\r\nFewer graphs are presented on one dashboard. Information is united and the display of the dashboard would be more organized.\r\nContrasting colors are used to help to deliver the information and improve the aesthetic design of the visualization.\r\nPart C: Proposed Visualisation\r\nPlease view the interactive visualization on Tableau Public here\r\nPart D: Step-by-step Guide\r\nAfter downloading data from the Department of Statistics, Singapore (DOS), we can prepare the proposed alternative data visualization step-by-step.\r\nData Preparation\r\nReorganizing the data by using Excel for further use. All the steps displayed below should be operated in both T1 and T2 sheets that contain Imports and Exports trading data separately.\r\nStep 1: Delete unnecessary rows\r\n\r\n\r\n\r\nStep 2: Rename undesired data Since this DataViz Makeover will only focus on the merchandise trade of the top 6 countries (Mainland China, Malaysia, United States. Taiwan, Japan, and Hong Kong) from the beginning of 2019 to the end of 2020, undesired data should be removed until the sheets look like the image below:\r\n\r\n\r\nStep 3: Reorganizing data Tableau recognizes variables by column. Because of this feature, the original data needs to be reorganized. First of all, we need to create a new worksheet named ‘Data’ in the original excel file. Add new headers in the Datasheet. There will be in total 4 variables and we should name them “Country”, “Time”, “Imports (K)”, and “Exports (K)”. “K” in the header stands for Thousand Dollars. Copy data from the original sheets and paste them into Data under corresponding headers. Remember to select the Transpose option while pasting. In order to let Tableau recognizes the “Time” variable as Date, we need to make sure data under the Time header is in the format of Date.\r\n\r\n\r\n\r\nStep 4: Delete undesired sheets Delete Content, T1, and T2 from the file. Only the sheet ‘Data’ should be kept.\r\nImporting Data into Tableau\r\nStep 1: Open Excel file in Tableau After open Tableau, select File from panel above to open the file we prepared:\r\nStep 2: Change the data type Making sure all the variables are in the correct data types. ‘Country’ should be a string format, recognized as Geographic role in Country. ‘Time’ should be recognized as Date. Exports (K) and Imports (K) should in the format of Number (whole).\r\n\r\n\r\n\r\nCreating Worksheets\r\nThere are two main purposes of the original graph, hence two worksheets will be created in this DataViz Makeover to ensure the proposed visualization can have all the functions that the original graph has.\r\nWorksheet 1: Balance of Trade of the top 6 countries\r\nStep 1: Add a new variable To draw the first graph, we need to add a new variable in Tableau that represents the Net Exports/ Balance of Trade of 6 selected countries. Get into the worksheet window, select Analysis > Create Calculated Field. Creating the formula of Net Exports by dragging the existed variables into the newly opened window and name it Net Exports (K):\r\n\r\n\r\nThen we can find a new variable called ‘Net Exports (K)’ on the left side panel.\r\nStep 2: Set up the graph Filling the columns and rows using existed variables as the image below. Tableau will automatically draw the graph in a horizontal bar format.\r\n\r\n\r\nStep 3: Improve the design The following procedures should be performed to improve the design of the graph:\r\nColoring the table based on the sum of the Net Exports of each year.Set the colors into a 2 steps color palette. In this way, the bar will be displayed in red if the Net Exports of a particular country are negative and blue otherwise. The two colors selected by Tableau are quite rich and significantly contrast with each other and the background, therefore we will keep the color choice in this way. The color card is going to be hidden from the graph since they are not necessary for the audience.\r\n\r\n\r\nAdding mark labels by selecting ‘Sum Net Export (K)’ under Label. Set the font size of the label to 8 and make the text bold. Set the labels into a lighter black so that they would not all the attention from the audience. Mark labels will help to identify the represented value of each bar.\r\nSort the graph in a descending order based on the sum of Net Exports values in 2020 (since the data in the latest year could be more important for the users). The will make the graph more organized.\r\nFormatting the tick marks on the x-axis into a darker black. Net export value is a continuous scale. Thick mark help to show the exact point on the axis.\r\nAdd title ‘Balance of Trade of Top 6 Countries (2019-2020)’. The font size is set to be 15 and bold.\r\nAdd Annotation by right-clicking the bars that worth attention. The font size of the annotation is set to be 10 and bold. If the important change is an improvement, the annotation would be green. If the change is degeneration, the color of the annotation would be red.\r\nThe resultant graph is as follows: \r\nWorksheet 2: Comparison of the Merchandise Trading Patterns of Top 6 Countries\r\nStep 1: Set up the graph Filling the columns and rows using existed variables as the image displayed below. Color the graph based on variable Country. Under Show Me, I selected Line (continuous) try. The resultant graph is shown below:\r\n\r\n\r\nA line graph has drawn here since we want to compare changes over the same period for all 6 countries. Line graph serves better than bar graph here since it can display some small changes within a period of time. The data covers merchandise trades over 2 years. In order to catch significant small changes and avoid messiness at the same time, the column is filled with Quarters (Time) instead of Years or Months.\r\nStep 2: Improve the design\r\nThe following procedures should be performed to improve the design of the graph:\r\nEnsure the y-axis for both the Exports and Imports sections share the same range so that the y-axis of the whole visualization is consistent. To achieve this, I set a fixed range for both y-axes as follows:\r\n\r\n\r\nReset the color of Malaysia to purple since the turquoise color originally chosen by Tableau does not efficiently contrast to some other colors in the graph (such as green and blue). Colors that strongly contrast with each other would help the users to read and compare the trading patterns of different countries.\r\n\r\n\r\nAdding labels and removing legend from the graph. Select ‘Country’ under Label and set the font size to 8 and bold. Make sure the label matches the mark color so audiences would know which line it indicates. A direct label is more convenient to read compares to legend.\r\n\r\n\r\nFormatting the tick marks on the axis into a darker black. Net exports value and Time are both continuous scales. Thick mark necessary for continuous scales.\r\nAdd title ‘Merchandise Trading Patterns of Top 6 Countries (2019-2020)’. The font size is set to be 15 and bold.\r\nAdd annotation to emphasize the main finding of the graph. The font size of the annotation is set to be 8 and bold.\r\nThe resultant graph is as follows: \r\nCreating Worksheets\r\nTo display both worksheets on a single page, we need to create a new dashboard. The final look of the dashboard is presented below: \r\nPart E: Main Observations from New Visualization\r\nBased on the graph Balance of Trade of Top 6 Countries (2019-2020), the balance of trade of these countries can be analyzed.\r\nHong Kong is always the one that has the greatest trade surplus (Exports > Imports) and Taiwan is the one that always has the greatest trade deficits (Exports <Imports). The abnormal trade surplus and deficits figure indicate there is a trade imbalance in these two regions. Taiwan kept having huge deficits means its national income flowed aboard and its economic performance is weakened during these two years. Investors who are considering investing in Taiwanese business or currency may need to put more thought into their decisions. On the other hand, the giant trade surplus of Hong Kong can also be seen from the graph Merchandise Trading Patterns of Top 6 Countries (2019-2020). Throughout the past two years, Hong Kong can be ranked second when it comes to export value, but the value of its imports is always significantly smaller than the others. Always having a huge surplus does not necessarily be a good sign. It means Hong Kong strongly reliant on foreign trade. The economic growth of Hong Kong could be unstable since it is easily affected.\r\nMainland China kept having a good proportion of trade surplus in two consecutive years. This indicates the economic growth of Mainland China is quite healthy and sustainable compares to the others.\r\nThere is a tremendous increment in the Net Exports of the United States from 2019 to 2020. It increased from a deficit of 14,400,862 thousand dollars to a surplus of 5,674,400 thousand dollars. This abnormally fast improvement may worth people’s attention and further study could be done to explore the reason behind it.\r\nWhile all the other countries are having increases in their net exports, Malaysia and Taiwan still experienced deterioration in their trade deficits. Especially for Malaysia, which experienced a 1494.93% increment in its trade deficits. This could be an indication of Malaysia’s poor economic performance in 2020.\r\nBased on the graph Merchandise Trading Patterns of Top 6 Countries (2019-2020), the historical trading patterns of these countries can be compared and analyzed.\r\nMainland China almost maintains 1st position for both the sum of the exports and imports value throughout these two years. This most likely thanks to its great population base.\r\nMany big-sized fluctuations occur since the fourth quarter of 2019. Both Mainland China and Malaysia had a huge decrease in their exports and imports value. China successfully stopped the decreasing trend after 1 quarter of the time, but around 4758 million dollars of exports was already lost. However, Malaysia’s trading trend kept decreasing for half a year and around 5918 million dollars of export value was reduced. This also explained why Malaysia is the only country that had a negative growth rate in these two years. The United States, on the other hand, had an abnormal increment in the value of its exports after 2019 Q4. The different experiences of these three countries during this period require further research to be explained.\r\nMainland China, The United States, and Malaysia also had more fluctuated patterns compare to the other 3 countries in the past two years.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-09T21:08:32+08:00",
    "input_file": "dataviz-makeover-1.knit.md"
  }
]
